In [1]:
import pandas as pd

In [2]:
import numpy as np
labels = ['a','b','c','d']
my_data = [10,20,30,40]
arr = np.array(my_data)
d = {'e':50,'f':60,'g':70,'h':80}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
pd.Series(my_data,labels)

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
d    40
dtype: int32

In [7]:
pd.Series(d)

e    50
f    60
g    70
h    80
dtype: int64

In [8]:
ser1 = pd.Series([1,2,3,4],['USA','CANADA','GERMANY','USSR'])
ser1

USA        1
CANADA     2
GERMANY    3
USSR       4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,5,4],['USA','JAPAN','GERMANY','MACK'])
ser2

USA        1
JAPAN      2
GERMANY    5
MACK       4
dtype: int64

In [10]:
ser1 + ser2

CANADA     NaN
GERMANY    8.0
JAPAN      NaN
MACK       NaN
USA        2.0
USSR       NaN
dtype: float64

In [11]:
# dataframes :
# create a df with random data (5 x 4)
from numpy.random import randn 
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.769417  0.706773 -0.012479  0.124138
B -0.223792  0.019337 -1.450533 -0.307244
C  0.291753 -0.188064  1.644146  0.157030
D  0.789580  0.722738  0.193283 -0.230463
E -0.394801  2.103641  0.251917 -0.344138

In [12]:
df['W'] # calling as series

A    0.769417
B   -0.223792
C    0.291753
D    0.789580
E   -0.394801
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df[['W','Z']]

          W         Z
A  0.769417  0.124138
B -0.223792 -0.307244
C  0.291753  0.157030
D  0.789580 -0.230463
E -0.394801 -0.344138

In [16]:
df

          W         X         Y         Z
A  0.769417  0.706773 -0.012479  0.124138
B -0.223792  0.019337 -1.450533 -0.307244
C  0.291753 -0.188064  1.644146  0.157030
D  0.789580  0.722738  0.193283 -0.230463
E -0.394801  2.103641  0.251917 -0.344138

In [17]:
# add new colum to df 
df['MX'] = df['W'] + df['Z']

In [18]:
df

          W         X         Y         Z        MX
A  0.769417  0.706773 -0.012479  0.124138  0.893555
B -0.223792  0.019337 -1.450533 -0.307244 -0.531037
C  0.291753 -0.188064  1.644146  0.157030  0.448783
D  0.789580  0.722738  0.193283 -0.230463  0.559117
E -0.394801  2.103641  0.251917 -0.344138 -0.738939

In [19]:
# drop colum :
# temporary drop for this transaction
df.drop('MX',axis = 1)

          W         X         Y         Z
A  0.769417  0.706773 -0.012479  0.124138
B -0.223792  0.019337 -1.450533 -0.307244
C  0.291753 -0.188064  1.644146  0.157030
D  0.789580  0.722738  0.193283 -0.230463
E -0.394801  2.103641  0.251917 -0.344138

In [20]:
# drop permnently 
df.drop('MX',axis = 1 , inplace = True)

In [21]:
df

          W         X         Y         Z
A  0.769417  0.706773 -0.012479  0.124138
B -0.223792  0.019337 -1.450533 -0.307244
C  0.291753 -0.188064  1.644146  0.157030
D  0.789580  0.722738  0.193283 -0.230463
E -0.394801  2.103641  0.251917 -0.344138

In [22]:
df.loc['C'] # accesing row data

W    0.291753
X   -0.188064
Y    1.644146
Z    0.157030
Name: C, dtype: float64

In [23]:
df.iloc[2] # index loc

W    0.291753
X   -0.188064
Y    1.644146
Z    0.157030
Name: C, dtype: float64

In [24]:
# 
df[df['Z'] > 0]

          W         X         Y         Z
A  0.769417  0.706773 -0.012479  0.124138
C  0.291753 -0.188064  1.644146  0.157030

In [25]:
df[df['Z'] > 0]['Z']

A    0.124138
C    0.157030
Name: Z, dtype: float64

In [26]:
df[df['W']>0][['W','Z']]

          W         Z
A  0.769417  0.124138
C  0.291753  0.157030
D  0.789580 -0.230463

In [27]:
df[(df['W']>0)& (df['Y']>0)][['W','Y']]

          W         Y
C  0.291753  1.644146
D  0.789580  0.193283